create function r1()
returns table
return(
select t.КодПоставщика,t.Марка, year(z.[ДатаИсполнения]) [год],
month(z.[ДатаИсполнения]) [месяц],
sum(n.Цена*(1-n.[Скидка])*n.Количество) [продали],
sum(t.Цена/[dbo].[Edin](t.[КодТовара])*n.Количество) [закупили],
sum(n.Цена*(1-n.[Скидка])*n.Количество) - sum(t.Цена/[dbo].[Edin](t.[КодТовара])*n.Количество) [прибыль]
from [dbo].Товары t inner join dbo.Заказано n
on t.КодТовара=n.КодТовара inner join dbo.Заказы z
on z.КодЗаказа=n.КодЗаказа
and z.[ДатаИсполнения] is not null
group by t.КодПоставщика,t.Марка, year(z.[ДатаИсполнения]),
month(z.[ДатаИсполнения])
)